tutorials/chtMultiRegion4NFFoam/pouchBatteryNPCM/constant/PCM/PCMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
b		b [0 0 0 0 0 0 0]	1.0e-3;

// ************************************************************************* //
