tutorials/chtMultiRegion4NFFoam/pouchBatteryNPCM/constant/PCM/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  NF4Foam;
type            naturalConvection;

Pr		Pr [ 0 0 0 0 0 0 0 ]	93.1;//It is needed for kappat
Prt		Prt [ 0 0 0 0 0 0 0 ]	0.85;
Sct		Sct [ 0 0 0 0 0 0 0 ]	0.85;
TRef            TRef [0 0 0 1 0 0 0]	300.0;


// ************************************************************************* //
