tutorials/chtMultiRegion4NFFoam/pouchBatteryNPCM/system/LIB/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            LIB_to_PCM
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName PCM;
                neighbourPatchName PCM_to_LIB;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 1940;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            LIB_to_PCM
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 18.2;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            LIB_to_PCM
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 1000;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            LIB_to_PCM
            {
                type            zeroGradient;
            }
        }
    }
}
// ************************************************************************* //
